In [28]:
import pandas as pd

In [29]:
df = pd.read_csv(r"D:\csv\credits.csv", index_col='person_id')

In [30]:
df

                  id                name                character      role
person_id
3748         tm84618      Robert De Niro            Travis Bickle     ACTOR
14658        tm84618        Jodie Foster            Iris Steensma     ACTOR
7064         tm84618       Albert Brooks                      Tom     ACTOR
3739         tm84618       Harvey Keitel  Matthew 'Sport' Higgins     ACTOR
48933        tm84618     Cybill Shepherd                    Betsy     ACTOR
...              ...                 ...                      ...       ...
736339     tm1059008    Adelaida Buscato                María Paz     ACTOR
399499     tm1059008  Luz Stella Luengas             Karen Bayona     ACTOR
373198     tm1059008         Inés Prieto                    Fanny     ACTOR
378132     tm1059008        Isabel Gaona                   Cacica     ACTOR
1950416    tm1059008      Julian Gaviria                      NaN  DIRECTOR

[77801 rows x 4 columns]

In [31]:
df.head(5)

                id             name                character   role
person_id
3748       tm84618   Robert De Niro            Travis Bickle  ACTOR
14658      tm84618     Jodie Foster            Iris Steensma  ACTOR
7064       tm84618    Albert Brooks                      Tom  ACTOR
3739       tm84618    Harvey Keitel  Matthew 'Sport' Higgins  ACTOR
48933      tm84618  Cybill Shepherd                    Betsy  ACTOR

In [32]:
df.shape

(77801, 4)

In [33]:
df.tail(10)

                  id                name               character      role
person_id
164248     tm1059008      Jessica Cediel         Liliana Navarro     ACTOR
1402344    tm1059008  Javier Gardeazábal  Agustín "Peluca" Ortíz     ACTOR
369222     tm1059008       Carla Giraldo          Valery Reinoso     ACTOR
369221     tm1059008   Ana María Sánchez                 Lourdes     ACTOR
368473     tm1059008        Aída Morales                 Maritza     ACTOR
736339     tm1059008    Adelaida Buscato               María Paz     ACTOR
399499     tm1059008  Luz Stella Luengas            Karen Bayona     ACTOR
373198     tm1059008         Inés Prieto                   Fanny     ACTOR
378132     tm1059008        Isabel Gaona                  Cacica     ACTOR
1950416    tm1059008      Julian Gaviria                     NaN  DIRECTOR

In [34]:
df.value_counts()

id         name               character                  role
tm160371   Dan Levy           Reporter                   ACTOR    2
tm88045    Philip Greene      Baseball Fan (uncredited)  ACTOR    2
ts42090    John Iii Franklin  Himself                    ACTOR    2
ts82526    Claudio Roca       Nicolás                    ACTOR    2
tm1000037  Aziz Dyab          Yusuf                      ACTOR    1
                                                                 ..
ts95997    Ja'Siah Young      Dion Warren                ACTOR    1
           Jason Ritter       Pat                        ACTOR    1
           Sammi Haney        Esperanza                  ACTOR    1
ts97584    Sebastian Perry    Himself - Host             ACTOR    1
ts9794     Jerry Seinfeld     Self - Host                ACTOR    1
Name: count, Length: 68025, dtype: int64

In [35]:
Schema_df = pd.read_csv(r"D:\csv\credits.csv")

In [36]:
Schema_df

,person_id,id,name,character,role
0,3748,tm84618,Robert De Niro,Travis Bickle,ACTOR
1,14658,tm84618,Jodie Foster,Iris Steensma,ACTOR
2,7064,tm84618,Albert Brooks,Tom,ACTOR
3,3739,tm84618,Harvey Keitel,Matthew 'Sport' Higgins,ACTOR
4,48933,tm84618,Cybill Shepherd,Betsy,ACTOR
...,...,...,...,...,...
77796,736339,tm1059008,Adelaida Buscato,María Paz,ACTOR
77797,399499,tm1059008,Luz Stella Luengas,Karen Bayona,ACTOR
77798,373198,tm1059008,Inés Prieto,Fanny,ACTOR
77799,378132,tm1059008,Isabel Gaona,Cacica,ACTOR
77800,1950416,tm1059008,Julian Gaviria,NaN,DIRECTOR

In [37]:
pd.set_option('display.max_columns',5)
pd.set_option('display.max_rows',400)

In [38]:
df

                  id                name                character      role
person_id
3748         tm84618      Robert De Niro            Travis Bickle     ACTOR
14658        tm84618        Jodie Foster            Iris Steensma     ACTOR
7064         tm84618       Albert Brooks                      Tom     ACTOR
3739         tm84618       Harvey Keitel  Matthew 'Sport' Higgins     ACTOR
48933        tm84618     Cybill Shepherd                    Betsy     ACTOR
...              ...                 ...                      ...       ...
736339     tm1059008    Adelaida Buscato                María Paz     ACTOR
399499     tm1059008  Luz Stella Luengas             Karen Bayona     ACTOR
373198     tm1059008         Inés Prieto                    Fanny     ACTOR
378132     tm1059008        Isabel Gaona                   Cacica     ACTOR
1950416    tm1059008      Julian Gaviria                      NaN  DIRECTOR

[77801 rows x 4 columns]

In [39]:
df.columns

Index(['id', 'name', 'character', 'role'], dtype='object')

In [40]:
df.iloc[0]

id                  tm84618
name         Robert De Niro
character     Travis Bickle
role                  ACTOR
Name: 3748, dtype: object

In [41]:
df.iloc[[0,1,2,3,4,5],0]

person_id
3748     tm84618
14658    tm84618
7064     tm84618
3739     tm84618
48933    tm84618
32267    tm84618
Name: id, dtype: object

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 77801 entries, 3748 to 1950416
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         77801 non-null  object
 1   name       77801 non-null  object
 2   character  68029 non-null  object
 3   role       77801 non-null  object
dtypes: object(4)
memory usage: 3.0+ MB

In [43]:
df['name'].unique

<bound method Series.unique of person_id
3748           Robert De Niro
14658            Jodie Foster
7064            Albert Brooks
3739            Harvey Keitel
48933         Cybill Shepherd
                  ...
736339       Adelaida Buscato
399499     Luz Stella Luengas
373198            Inés Prieto
378132           Isabel Gaona
1950416        Julian Gaviria
Name: name, Length: 77801, dtype: object>

In [44]:
df

                  id                name                character      role
person_id
3748         tm84618      Robert De Niro            Travis Bickle     ACTOR
14658        tm84618        Jodie Foster            Iris Steensma     ACTOR
7064         tm84618       Albert Brooks                      Tom     ACTOR
3739         tm84618       Harvey Keitel  Matthew 'Sport' Higgins     ACTOR
48933        tm84618     Cybill Shepherd                    Betsy     ACTOR
...              ...                 ...                      ...       ...
736339     tm1059008    Adelaida Buscato                María Paz     ACTOR
399499     tm1059008  Luz Stella Luengas             Karen Bayona     ACTOR
373198     tm1059008         Inés Prieto                    Fanny     ACTOR
378132     tm1059008        Isabel Gaona                   Cacica     ACTOR
1950416    tm1059008      Julian Gaviria                      NaN  DIRECTOR

[77801 rows x 4 columns]